###########################################################################################################
# Task. Прочитать файлы json, определить их кодировку, вывести топ-10 встречаемых слов в каждом файле
###########################################################################################################

import chardet
from os import listdir
import json


######################################################################
# Получаем все json файлы в текущей дирректории
######################################################################
def get_json_files():
    json_files = list(filter(lambda x: x.endswith('.json'), listdir()))
    return json_files


#####################################################################
# Получаем топ 10 встречаемых слов
#####################################################################
def get_top_words(name, file):

    ###########################################################################
    # Получаем список новостей
    ###########################################################################
    news = file['rss']['channel']['items']

    for item in news:
        words = item['description'].split()
        for word in words:
            if len(word) > 6:
                pass

######################################################################
# Определяем кодировку файла и считаем его
######################################################################
def read_file():
    json_files = get_json_files()
    for file in json_files:

        #########################################################################
        # Определяем кодировку файла, передаем на обработку json
        #########################################################################
        with open(file, 'rb') as byte_file:
            file = byte_file.read()
            result = chardet.detect(file)

            #############################################################################
            # Передаем в функцию подсчета статистики обработанный json'ом объект
            #############################################################################
            get_top_words(file, json.loads(file.decode(result['encoding'])))


read_file()
