###########################################################################################################
# Task. Прочитать файлы json, определить их кодировку, вывести топ-10 встречаемых слов в каждом файле
###########################################################################################################

import chardet
from os import listdir
import json
from pprint import pprint


######################################################################
# Получаем все json файлы в текущей дирректории
######################################################################
def get_json_files():
    json_files = list(filter(lambda x: x.endswith('.json'), listdir()))
    return json_files


#####################################################################
# Получаем топ 10 встречаемых слов
#####################################################################
def get_top_words(file):

    ###########################################################################
    # Получаем список новостей
    ###########################################################################
    news = file['rss']['channel']['items']

    ###########################################################################
    # Проходим по каждой статье в новостях
    ###########################################################################
    top_words = {}
    for item in news:
        words = item['description'].split()

        #############################################################################
        # Проходим по каждому слову в статье
        #############################################################################
        for word in words:
            if len(word) > 6:
                if word in top_words:
                    top_words[word] += 1
                else:
                    top_words[word] = 1
    return top_words


######################################################################
# Определяем кодировку файла и считаем его
######################################################################
def read_file():
    json_files = get_json_files()
    statistics = {}
    for file in json_files:
        print(file)
        #########################################################################
        # Определяем кодировку файла, передаем на обработку json
        #########################################################################
        with open(file, 'rb') as byte_file:
            f = byte_file.read()
            result = chardet.detect(f)

            #############################################################################
            # Передаем в функцию подсчета статистики обработанный json'ом объект
            #############################################################################
            statistics[file] = get_top_words(json.loads(f.decode(result['encoding'])))

    return statistics


stat = read_file()
pprint(stat)
